## Staging: terragrunt/env/staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 3 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                      NAME                                                      |
|----------|----------------------------------------------------------------------------------------------------------------|
| delete   | `module.website.aws_route53_record.cloudfront_certificate_validation[&quot;*.design-test.cra-arc.alpha.canada.ca&quot;]` |
|          | `module.website.aws_route53_record.cloudfront_certificate_validation[&quot;design-test.cra-arc.alpha.canada.ca&quot;]`   |
| update   | `module.website.aws_cloudfront_distribution.simple_static_website`                                             |
|          | `module.website.aws_cloudfront_origin_access_identity.simple_static_website`                                   |
|          | `module.website.aws_s3_bucket_policy.oai_policy`                                                               |
| recreate | `module.website.aws_acm_certificate.cloudfront[0]`                                                             |
|          | `module.website.aws_acm_certificate_validation.cloudfront[0]`                                                  |
|          | `module.website.aws_route53_record.cloudfront_alias`                                                           |
|          | `module.website.aws_route53_zone.hosted_zone[0]`                                                               |
| add      | `module.website.aws_route53_record.cloudfront_certificate_validation[&quot;*.design.cra-arc.alpha.canada.ca&quot;]`      |
|          | `module.website.aws_route53_record.cloudfront_certificate_validation[&quot;design.cra-arc.alpha.canada.ca&quot;]`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.website.data.aws_iam_policy_document.s3_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cra-arc-ucdg-gcau-static-website-staging/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E1JDPYW92C81JV",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.website.aws_acm_certificate.cloudfront[0] must be replaced
+/- resource "aws_acm_certificate" "cloudfront" {
      ~ arn                       = "arn:aws:acm:us-east-1:211125499457:certificate/482f9036-4386-49cc-832e-06a40a6e2f36" -> (known after apply)
      ~ domain_name               = "design-test.cra-arc.alpha.canada.ca" -> "design.cra-arc.alpha.canada.ca" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.design-test.cra-arc.alpha.canada.ca"
              - resource_record_name  = "_8d0121ecdf5137ce8449399fe1ab6f4d.design-test.cra-arc.alpha.canada.ca."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_160134768eaba473afab7843e0f1836c.xlfgrmvvlj.acm-validations.aws."
            },
          - {
              - domain_name           = "design-test.cra-arc.alpha.canada.ca"
              - resource_record_name  = "_8d0121ecdf5137ce8449399fe1ab6f4d.design-test.cra-arc.alpha.canada.ca."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_160134768eaba473afab7843e0f1836c.xlfgrmvvlj.acm-validations.aws."
            },
          + {
              + domain_name           = "*.design.cra-arc.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "design.cra-arc.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:211125499457:certificate/482f9036-4386-49cc-832e-06a40a6e2f36" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-08-13T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-07-15T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "*.design-test.cra-arc.alpha.canada.ca",
          - "design-test.cra-arc.alpha.canada.ca",
          + "*.design.cra-arc.alpha.canada.ca",
          + "design.cra-arc.alpha.canada.ca",
        ]
        tags                      = {
            "CostCentre" = "cra-arc-ucdg-gcau-staging"
            "Terraform"  = "true"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ options {
          + arn                       = (known after apply)
          + certificate_authority_arn = (known after apply)
          + certificate_body          = (known after apply)
          + certificate_chain         = (known after apply)
          + domain_name               = (known after apply)
          + domain_validation_options = (known after apply)
          + early_renewal_duration    = (known after apply)
          + id                        = (known after apply)
          + key_algorithm             = (known after apply)
          + not_after                 = (known after apply)
          + not_before                = (known after apply)
          + pending_renewal           = (known after apply)
          + private_key               = (known after apply)
          + renewal_eligibility       = (known after apply)
          + renewal_summary           = (known after apply)
          + status                    = (known after apply)
          + subject_alternative_names = (known after apply)
          + tags                      = (known after apply)
          + tags_all                  = (known after apply)
          + type                      = (known after apply)
          + validation_emails         = (known after apply)
          + validation_method         = (known after apply)
        } -> (known after apply)
    }

  # module.website.aws_acm_certificate_validation.cloudfront[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "cloudfront" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:211125499457:certificate/482f9036-4386-49cc-832e-06a40a6e2f36" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "2025-07-15 15:05:11.235 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_8d0121ecdf5137ce8449399fe1ab6f4d.design-test.cra-arc.alpha.canada.ca",
        ] -> (known after apply) # forces replacement
    }

  # module.website.aws_cloudfront_distribution.simple_static_website will be updated in-place
  ~ resource "aws_cloudfront_distribution" "simple_static_website" {
      ~ aliases                         = [
          - "design-test.cra-arc.alpha.canada.ca",
          + "design.cra-arc.alpha.canada.ca",
        ]
        id                              = "E20IKGQUTS18Z7"
        tags                            = {
            "CostCentre" = "cra-arc-ucdg-gcau-staging"
            "Terraform"  = "true"
        }
        # (21 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:211125499457:certificate/482f9036-4386-49cc-832e-06a40a6e2f36" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.website.aws_cloudfront_origin_access_identity.simple_static_website will be updated in-place
  ~ resource "aws_cloudfront_origin_access_identity" "simple_static_website" {
      ~ comment                         = "Allow CloudFront to reach the S3 bucket for domain design-test.cra-arc.alpha.canada.ca" -> "Allow CloudFront to reach the S3 bucket for domain design.cra-arc.alpha.canada.ca"
        id                              = "E1JDPYW92C81JV"
        # (6 unchanged attributes hidden)
    }

  # module.website.aws_route53_record.cloudfront_alias must be replaced
-/+ resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "design-test.cra-arc.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z05954391VBOM0NMIIQ21_design-test.cra-arc.alpha.canada.ca_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "design-test.cra-arc.alpha.canada.ca" -> "design.cra-arc.alpha.canada.ca" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z05954391VBOM0NMIIQ21" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.website.aws_route53_record.cloudfront_certificate_validation["*.design-test.cra-arc.alpha.canada.ca"] will be destroyed
  # (because key ["*.design-test.cra-arc.alpha.canada.ca"] is not in for_each map)
  - resource "aws_route53_record" "cloudfront_certificate_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_8d0121ecdf5137ce8449399fe1ab6f4d.design-test.cra-arc.alpha.canada.ca" -> null
      - id                               = "Z05954391VBOM0NMIIQ21__8d0121ecdf5137ce8449399fe1ab6f4d.design-test.cra-arc.alpha.canada.ca._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_8d0121ecdf5137ce8449399fe1ab6f4d.design-test.cra-arc.alpha.canada.ca" -> null
      - records                          = [
          - "_160134768eaba473afab7843e0f1836c.xlfgrmvvlj.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z05954391VBOM0NMIIQ21" -> null
        # (2 unchanged attributes hidden)
    }

  # module.website.aws_route53_record.cloudfront_certificate_validation["*.design.cra-arc.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "cloudfront_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.website.aws_route53_record.cloudfront_certificate_validation["design-test.cra-arc.alpha.canada.ca"] will be destroyed
  # (because key ["design-test.cra-arc.alpha.canada.ca"] is not in for_each map)
  - resource "aws_route53_record" "cloudfront_certificate_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_8d0121ecdf5137ce8449399fe1ab6f4d.design-test.cra-arc.alpha.canada.ca" -> null
      - id                               = "Z05954391VBOM0NMIIQ21__8d0121ecdf5137ce8449399fe1ab6f4d.design-test.cra-arc.alpha.canada.ca._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_8d0121ecdf5137ce8449399fe1ab6f4d.design-test.cra-arc.alpha.canada.ca" -> null
      - records                          = [
          - "_160134768eaba473afab7843e0f1836c.xlfgrmvvlj.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z05954391VBOM0NMIIQ21" -> null
        # (2 unchanged attributes hidden)
    }

  # module.website.aws_route53_record.cloudfront_certificate_validation["design.cra-arc.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "cloudfront_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.website.aws_route53_zone.hosted_zone[0] must be replaced
-/+ resource "aws_route53_zone" "hosted_zone" {
      ~ arn                 = "arn:aws:route53:::hostedzone/Z05954391VBOM0NMIIQ21" -> (known after apply)
      ~ id                  = "Z05954391VBOM0NMIIQ21" -> (known after apply)
      ~ name                = "design-test.cra-arc.alpha.canada.ca" -> "design.cra-arc.alpha.canada.ca" # forces replacement
      ~ name_servers        = [
          - "ns-1509.awsdns-60.org",
          - "ns-1616.awsdns-10.co.uk",
          - "ns-248.awsdns-31.com",
          - "ns-922.awsdns-51.net",
        ] -> (known after apply)
      ~ primary_name_server = "ns-1509.awsdns-60.org" -> (known after apply)
        tags                = {
            "CostCentre" = "cra-arc-ucdg-gcau-staging"
            "Terraform"  = "true"
        }
      ~ zone_id             = "Z05954391VBOM0NMIIQ21" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.website.aws_s3_bucket_policy.oai_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "oai_policy" {
        id     = "cra-arc-ucdg-gcau-static-website-staging"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E1JDPYW92C81JV"
                        }
                      - Resource  = "arn:aws:s3:::cra-arc-ucdg-gcau-static-website-staging/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 3 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.website.aws_s3_bucket.this"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
